# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Daily apps
cask 'flux'
cask 'alfred'
cask '1password'
cask 'dropbox'
cask 'moom'

# Communication & planning
cask 'notion'
cask 'slack'
cask 'teamviewer'

# Browsers
cask 'google-chrome'
cask 'firefox'

# Dev apps
cask 'tower'
cask 'codekit'
cask 'sublime-text'
cask 'sequel-pro'
cask 'iterm2'
cask 'mamp'
cask 'imageoptim'
cask 'imagealpha'

# Design apps
cask 'axure-rp'
cask 'sketch'
cask 'sketch-toolbox'
cask 'rightfont'
cask 'adobe-cs6-master-collection'

# Utility apps
cask 'cleanmymac'
cask 'bartender'
cask 'aerial'
cask 'purevpn'
cask 'spotify'
cask 'soundcleod'
cask 'silverlight'
cask 'textexpander'
cask 'caffeine'
cask 'spamsieve'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps https://github.com/mas-cli/mas
mas 'Keynote', id: 409183694
mas 'Ulysses', id: 623795237
mas 'Airmail 3', id: 918858936
mas 'Clean', id: 418412301
mas 'Moom', id: 419330170
mas 'Kuvva', id: 451557061
mas '1Password', id: 443987910
mas 'StuffIt Expander', id: 405580712
mas 'iA Writer Classic', id: 439623248
mas 'Be Focused Pro - Focus Timer & Goal Tracker', id: 961632517
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Reeder', id: 880001334
mas 'Transmit', id: 403388562
mas 'Wunderlist', id: 410628904
mas 'Slack', id: 803453959
mas 'On The Job', id: 404699732